package com.ttbgz.huifu.enums;

import lombok.Getter;

/**
 * 返回类型枚举
 *
 * @author Administrator
 */

@Getter
public enum RespCodeEnum {
    CODE_00000000("00000000", "交易受理成功；注：交易状态以trans_stat为准；"),
    CODE_00000100("00000100", "下单成功"),
    CODE_10000000("10000000", "产品号不能为空,订单已超时 %s不能为空（%s代指报错参数名）等.."),
    CODE_20000000("20000000", "重复交易，产品号状态异常，"),
    CODE_21000000("21000000", "手续费金额、手续费收取方式、手续费扣款标识、手续费子客户号、手续费账户号，必须同时为空或同时必填"),
    CODE_22000000("22000000", "产品号不存在"),
    CODE_22000002("22000002", "商户信息不存在,商户状态异常"),
    CODE_22000003("22000003", "延迟账户不存在,商户账户信息不存在"),
    CODE_22000004("22000004", "暂未开通分账权限,暂未开通%s权限（%s代指报错参数名"),
    CODE_22000005("22000005", "手续费承担方必须参与分账，分账列表必须包含主交易账户，其他商户分账比例过高"),
    CODE_23000003("23000003", "交易金额不足以支付内扣手续费，优惠金额大于交易金额"),
    CODE_23000004("23000004", "交易类型不支持，当前交易类型不支持商户贴息"),
    CODE_90000000("90000000", "业务执行失败；如：账户可用余额不足，该功能已关闭->交易失败，，单日金额超限，请联系额服提额"),
    CODE_91111119("91111119", "通道异常，请稍后重试"),
    CODE_98888888("98888888", "系统错误");
    private final String code;
    private final String msg;

    private RespCodeEnum(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}
